Embracecactus/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_agent_product.c
/****************************************************************************
 * app/bk7258/bk7258_agent_product.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * BK7258 product application lifecycle for the official openvela Agent.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_BK7258_APP_AGENT

#include <errno.h>
#include <sched.h>
#include <pthread.h>
#include <semaphore.h>
#include <stdatomic.h>
#include <stdio.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>
#include <sys/stat.h>
#include <sys/mount.h>
#include <time.h>
#include <syslog.h>
#include <unistd.h>
#include <mbedtls/platform_util.h>

#include <nuttx/signal.h>
#include <nuttx/mutex.h>

#include <arch/board/board.h>
#include "agent_compat.h"
#include "agent_config.h"
#include "core/agent_loop.h"
#include "core/memory_store.h"
#include "core/message_bus.h"
#include "core/session_mgr.h"
#include "infra/config_store.h"
#include "infra/http_proxy.h"
#include "llm/llm_proxy.h"
#include "llm/llm_router.h"
#include "tools/tool_guard.h"
#include "tools/tool_files.h"
#include "voice/voice_channel.h"
#include "voice/voice_asr.h"
#include "voice/voice_tts.h"
#ifdef CONFIG_BK7258_VISION_SERVICE
#include "bk7258_agent_vision.h"
#endif
#ifdef CONFIG_BK7258_VOICE_TLS
#include "cJSON.h"
#include "tools/tool_registry.h"
#include <nuttx/power/battery_ioctl.h>
#include "bk7258_health_service.h"
#include "bk7258_motion_service.h"
#include "bk7258_haptic_service.h"
#ifdef CONFIG_BK7258_DISPLAY_SERVICE
#include "bk7258_display_service.h"
#include "bk7258_control_ota_request.h"
#include "bk7258_cloud_http.h"
#include "bk7258_voice_tls.h"
#include <mbedtls/sha256.h>
#include <netutils/netlib.h>
#endif
#include "voice/audio_capture.h"
#include <media_recorder.h>
#include "bk7258_agent_cloud.h"
#include "bk7258_agent_ota.h"
#include "bk7258_cloud_config.h"
#include "bk7258_provision_identity.h"
#ifdef CONFIG_BK7258_PROVISION_NATIVE
#include "bk7258_provision_bootstrap.h"
#endif
#include "bk7258_provision_claim.h"
#include "bk7258_provision_settings.h"
#include "bk7258_focus.h"
#include "bk7258_provision_config.h"
#include "bk7258_provision_storage.h"
#include "bk7258_provision_time.h"
#include "bk7258_provision_owner.h"
#include "bk7258_provision_gatt.h"
#include "bk7258_provision_network.h"
#include "bk7258_provision_scan.h"
#include "bk7258_agent_trigger.h"
#include "bk7258_voice_media.h"
#ifdef CONFIG_AI_AGENT_LVGL_UI
/* Official declaration of lvgl_ui_channel_show(); the src include path
 * is exposed by agent_framework.cmake.
 */
#include "lvgl_ui_channel.h"
#endif
#include "bk7258_voice_volume_store.h"
#ifdef CONFIG_BK7258_PRODUCT_KEYS
#include "bk7258_voice_button.h"
#ifdef CONFIG_BK7258_PM_SOFT_OFF
#include "bk7258_media_volume.h"
#include <arch/chip/bk7258_pm.h>
#ifdef CONFIG_BK7258_VISION_SERVICE
#include "bk7258_vision_service.h"
#endif
#ifdef CONFIG_BK7258_HAPTIC_SERVICE
#include "bk7258_haptic_service.h"
#endif
#endif
#endif
#include "bk7258_preferences.h"
#ifdef CONFIG_BK7258_PREFERENCES
#include "bk7258_agent_memory.h"
#endif
#include <arch/chip/bk7258_wifi.h>
#ifdef BKAGENT_APP_OTA_ENABLED
#include <arch/chip/bk7258_active_image.h>
#include <arch/chip/bk7258_ota_rpmsg.h>
#endif
#include "bk7258_voice_config.h"
#endif

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* The device_control tool declares one shared numeric bound so the JSON
 * schema never advertises a value the execution path must reject. Volume
 * uses 0..MAX and vibration uses 1..MAX milliseconds.
 */
#define BK7258_TOOL_VALUE_MAX 100
#define BK7258_STRINGIFY_(x) #x
#define BK7258_STRINGIFY(x) BK7258_STRINGIFY_(x)

#ifdef CONFIG_BK7258_VOICE_TLS
/* The existing provisioning owner borrows this identity for its lifetime.
 * It is never copied or freed while a claim/control session uses it.
 */

static struct bkprov_identity_s g_identity;
static bool g_identity_bound;
static bool g_control_bound;
static bool g_save_first;
static atomic_bool g_probe_running;
static atomic_int g_probe_worker_result;
static bool g_cloud_loaded;
static bool g_configured;
static bool g_trigger_started;
static int g_product_error;
static int g_service_result = -ENOTCONN;
static int g_probe_result = -ENOTCONN;
static uint64_t g_config_revision;
static sem_t g_product_wake;
static atomic_uint g_product_events;
static atomic_bool g_agent_core_ready;
static atomic_bool g_voice_initialized;
static atomic_bool g_agent_ready;
static atomic_int g_voice_event_result;
static atomic_bool g_trigger_prepare_pending = ATOMIC_VAR_INIT(true);
static mutex_t g_persona_lock = NXMUTEX_INITIALIZER;
static atomic_int g_active_persona = ATOMIC_VAR_INIT(-1);
/* This is process-local only. SRV1/SRR1 remain the restart-safe authority;
 * FINISHING preserves the post-worker teardown when storage changes to
 * positively empty after a successful reset. */
enum product_reset_phase_e { PRODUCT_RESET_IDLE, PRODUCT_RESET_QUIESCING,
                             PRODUCT_RESET_FINISHING };
static enum product_reset_phase_e g_reset_phase;

/* Media Trigger reports only product wake admission here. The official voice
 * channel remains the sole conversational lifecycle owner.
 */

/****************************************************************************
 * Private Functions
 ****************************************************************************/

void bk7258_agent_product_wake(void)
{
  atomic_fetch_or(&g_product_events, 4);
  sem_post(&g_product_wake);
}

static void bk7258_agent_voice_event(int event, int result)
{
  unsigned int flags = 0;
#ifdef CONFIG_BK7258_DISPLAY_SERVICE
  if (event == VOICE_CHANNEL_EVENT_OUTPUT_STARTED ||
      event == VOICE_CHANNEL_EVENT_OUTPUT_FINISHED)
    {
      bk7258_display_speaking(event == VOICE_CHANNEL_EVENT_OUTPUT_STARTED);
      return;
    }
#endif
  if (event == VOICE_CHANNEL_EVENT_WAKE_ACK_REQUEST)
    {
      /* The Agent reader is paused; its producer still drains and erases
       * microphone PCM until this synchronous playback has drained. */
      voice_channel_wake_ack_result(bk7258_agent_trigger_reply());
      return;
    }
  if (event == VOICE_CHANNEL_EVENT_WAKE_ACK_SKIP)
    {
      bk7258_agent_trigger_reply_discard();
      return;
    }
  if (event == VOICE_CHANNEL_EVENT_WAKE_ACK_CANCEL)
    {
      bk7258_agent_trigger_reply_cancel();
      return;
    }
  if (event == VOICE_CHANNEL_EVENT_INITIALIZED)
    {
      atomic_store(&g_voice_initialized, result == 0);
      flags = 1;
    }
  else if (event == VOICE_CHANNEL_EVENT_SERVICE_READY)
    {
      atomic_store(&g_agent_ready, result == 0);
      flags = 1;
    }
  else if (event == VOICE_CHANNEL_EVENT_TURN_COMPLETE)
    {
      bk7258_agent_trigger_reply_discard();
      atomic_store(&g_voice_event_result, result);
      flags = 2;
    }

  if (flags)
    {
      atomic_fetch_or(&g_product_events, flags);
      sem_post(&g_product_wake);
    }
}

static void bk7258_agent_storage_changed(void)
{
  atomic_fetch_or(&g_product_events, 8);
  sem_post(&g_product_wake);
}

static bool product_voice_result_exits_interaction(int result)
{
  /* 只有成功的回答继续免唤醒对话。超时、传输或工具失败已经结束
   * 本次请求，必须恢复唤醒，不能立刻开启一次无人请求的录音。
   * TURN_COMPLETE 仍是资源释放边界；未释放的 Media 由 recover
   * 继续处理，rearm 的失败不能被当作已经恢复。
   */

