Embracecactus/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_agent_product.c
  return result != 0;
}

#ifdef CONFIG_BK7258_PRODUCT_KEYS
static void product_keys_notify(void)
{
  sem_post(&g_product_wake);
}

#include "bk7258_agent_product_power.inc"
#endif

static int product_apply_persona(int requested)
{
  static const char *const styles[] = {
    "温柔陪伴，耐心回应，不催促用户。",
    "活泼俏皮，轻松有趣，但不打断或嘲笑用户。",
    "安静倾听，简短回应，给用户留出表达空间。",
    "认真交流，表达清楚，帮助用户理清思路。",
    "带一点俏皮的小别扭，但不羞辱、操控或贬低用户。"
};

  struct bk7258_preferences_s preferences;
  FILE *file;
  int ret = nxmutex_lock(&g_persona_lock);
  if (ret < 0)
    {
      return ret;
    }

  if (requested >= 0)
    {
      const char *name = bk7258_preferences_persona_name(requested);
      ret = name ? bk7258_preferences_set_persona(name) : -EINVAL;
    }

  if (!ret)
    {
      ret = bk7258_preferences_get(&preferences);
    }

  if (!ret && requested >= 0 &&
      (preferences.persona_is_default || preferences.persona != requested))
{
  ret = -EIO;
}

  if (!ret && (unsigned int)preferences.persona >=
      sizeof(styles) / sizeof(styles[0]))
{
  ret = -EBADMSG;
}

  /* The persistent fact still lives in the existing SD configuration
   * store. This only projects it into the persona file that the
   * official agent reads per turn; conversation history is not changed,
   * memory is neither migrated nor decrypted, and LLM requests are not
   * rewritten in the protocol adapter. The atomic replacement keeps the
   * Agent from reading a half-written persona file if it happens to start
   * the next turn.
   */

  if (!ret)
    {
      file = fopen(AGENT_SOUL_FILE ".new", "w");
      if (!file)
        {
          ret = -errno;
        }
      else
        {
          if (fprintf(file, "# 傻妞\n\n"
                      "你是运行在 openvela 设备上的 AI 伴侣，"
                      "不是真人。\n"
                      "当前聊天风格：%s\n"
                      "风格只影响表达，"
                      "不改变官方规则和真实能力边界。\n"
                      "硬件动作必须在本轮真实调用工具"
                      "且成功后才能说已完成。"
                      "用户要求再来一次、再次振动时必须"
                      "重新调用工具；"
                      "不得只模仿声音或沿用历史成功。\n",
                      styles[preferences.persona]) < 0) ret = -EIO;
          if (fclose(file) != 0 && !ret)
            {
              ret = -errno;
            }

          if (!ret && rename(AGENT_SOUL_FILE ".new", AGENT_SOUL_FILE) < 0)
            {
              ret = -errno;
            }

          if (ret)
            {
              (void)unlink(AGENT_SOUL_FILE ".new");
            }
        }
    }

  if (!ret)
    {
      atomic_store(&g_active_persona, preferences.persona);
      syslog(LOG_INFO, "BKVOICE persona applied=%s source=%s\n",
             bk7258_preferences_persona_name(preferences.persona),
             preferences.persona_is_default ? "default" : "persistent");
    }

  nxmutex_unlock(&g_persona_lock);
  return ret;
}

static int product_control(void *context, enum bkcontrol_command_e command,
                            uint32_t value,
                            struct bkcontrol_status_s *status)
{
  int ret = 0;
  unsigned int volume;
  (void)context;
  memset(status, 0xff, sizeof(*status));
  status->flags = 0;
  if (bkagent_ota_busy() && command != BKCONTROL_INFO &&
      command != BKCONTROL_STATUS) return -EBUSY;
  switch (command)
    {
      case BKCONTROL_INFO:
#ifdef BKAGENT_APP_OTA_ENABLED
        {
          struct bk7258_mcuboot_version_s version;
          struct bk7258_ota_pair_snapshot_s pair;
          ret = bk7258_active_ap_image_version(&version);
          if (!ret) ret = bk7258_ota_rpmsg_pair_status(&pair,
            CONFIG_BK7258_OTA_RPMSG_CONTROL_TIMEOUT_MS);
          if (ret)
            {
              return ret;
            }

          if (pair.state != BK7258_OTA_PAIR_CONFIRMED ||
              !pair.security_counter_present || !pair.security_counter ||
              !bk7258_mcuboot_version_equal(&version, &pair.version))
            {
              return -EAGAIN;
            }

          status->device_info.major = version.major;
          status->device_info.minor = version.minor;
          status->device_info.revision = version.revision;
          status->device_info.build = version.build;
          status->device_info.security_counter = pair.security_counter;
          return 0;
        }

#else
        return -ENOTSUP;
#endif
      case BKCONTROL_STATUS: break;
      case BKCONTROL_CANCEL: ret = voice_channel_cancel(); break;
      case BKCONTROL_CLEAR_HISTORY:
        if (!voice_channel_is_idle())
        {
          return -EBUSY;
        }

        ret = session_clear("voice");
#ifdef CONFIG_BK7258_PREFERENCES
        if (!ret)
        {
          ret = bkagent_memory_commit(atomic_load(&g_active_persona), NULL);
        }
#endif
        break;
#ifdef CONFIG_BK7258_PREFERENCES
      case BKCONTROL_MEMORY_SET:
      case BKCONTROL_MEMORY_DELETE:
        if (!voice_channel_is_idle())
        {
          return -EBUSY;
        }

        ret = bkagent_memory_control(command, value,
                                     atomic_load(&g_active_persona));
        break;
#endif
      case BKCONTROL_VOLUME:
        if (value > 100u)
        {
          return -EINVAL;
        }

        if (!voice_channel_is_idle())
        {
          return -EBUSY;
        }

        ret = bkvoice_media_volume(true, value, &volume);
        if (!ret)
        {
          status->volume = volume;
          ret = bkvoice_volume_store_set(volume);
        }
        break;
      case BKCONTROL_PERSONA:
        if (value > BK7258_PERSONA_TSUNDERE_LITE)
        {
          return -EINVAL;
        }

        if (!voice_channel_is_idle())
        {
          return -EBUSY;
        }

        ret = product_apply_persona((int)value);
        break;
      default: return -ENOTSUP;
    }

  if (ret < 0)
    {
      return ret;
    }

  bool idle = voice_channel_is_idle();
  status->flags = (g_configured && bk7258_agent_trigger_armed() ? 1u : 0u) |
                  (!idle || bkagent_ota_busy() ? 2u : 0u) | 16384u;
#ifdef CONFIG_BK7258_PREFERENCES
  status->flags |= bkagent_memory_flags();
#endif
#ifdef BKAGENT_APP_OTA_ENABLED
  status->flags |= 4096u | 8192u;
#endif
  /* SDC1 reports the official whole-turn state. Recorder state is not used
   * as a proxy for Agent, TTS or Media completion.
   */

  status->error = 0;
  if (idle)
    {
      status->flags |= 4u;
      status->turn = BKCONTROL_TURN_IDLE;
      status->error = g_product_error;
    }

  if (idle && command != BKCONTROL_CANCEL &&
      bkvoice_media_volume(false, 0, &volume) == 0)
    {
      status->volume = volume;
      status->flags |= 8u;
    }

