Embracecactus/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_agent_product.c
  int persona = atomic_load(&g_active_persona);
  if (persona >= 0)
    {
      status->persona = (uint32_t)persona;
      status->flags |= 16u;
    }

  struct bk7258_wifi_result_s wifi;
  if (bk7258_wifi_read_link(&wifi) == 0)
    {
      status->flags |= 1024u;
      if (wifi.ipaddr && bk7258_wifi_native_lease_matches(&wifi))
        {
          status->flags |= 2048u;
        }
    }

  return 0;
}

static char *product_tools(void)
{
  return strdup("[{\"name\":\"device_status\",\"description\":"
    "\"Read this device's speaker volume, mood and cached battery "
    "voltage/charging state. Battery percentage is unavailable: never "
    "estimate it from voltage.\",\"input_schema\":"
    TOOL_NO_PARAMS "}"
#ifdef CONFIG_BK7258_MOTION_SERVICE
    ",{\"name\":\"device_motion\",\"description\":"
    "\"Read fresh three-axis acceleration including gravity from this "
    "board. It has an accelerometer, not a gyroscope; cannot measure "
    "angular velocity.\",\"input_schema\":"
    TOOL_NO_PARAMS "}"
#endif
    ",{\"name\":\"device_control\",\"description\":"
    "\"Only on the user's request, set speaker volume (value 0-100 "
    "percent), mood/chat style (mood), or vibrate briefly (value 1-100 "
    "milliseconds). Every repeat request needs a fresh tool call; never "
    "claim another action based on an earlier success. "
#ifdef CONFIG_BK7258_DISPLAY_SERVICE
    "Use action eyes only when the user explicitly asks to change the "
    "eye expression. Do not call it to decorate an ordinary answer or joke; "
    "local display handles blinking and the speaking state automatically. "
#endif
    "Report errors honestly.\","
    "\"input_schema\":{\"type\":\"object\",\"properties\":{"
    "\"action\":{\"type\":\"string\",\"enum\":[\"volume\",\"mood\""
#ifdef CONFIG_BK7258_HAPTIC_SERVICE
    ",\"vibrate\""
#endif
#ifdef CONFIG_BK7258_DISPLAY_SERVICE
    ",\"eyes\""
#endif
    "]},"
#ifdef CONFIG_BK7258_DISPLAY_SERVICE
    "\"expression\":{\"type\":\"string\",\"enum\":[\"neutral\","
    "\"happy\",\"shy\",\"sad\",\"surprised\",\"thinking\",\"listening\","
    "\"speaking\",\"sleepy\"]},"
#endif
    "\"value\":{\"type\":\"integer\",\"minimum\":0,"
    "\"maximum\":" BK7258_STRINGIFY(BK7258_TOOL_VALUE_MAX) "},"
    "\"mood\":{\"type\":\"string\",\"enum\":[\"gentle\",\"playful\","
    "\"quiet\",\"serious\",\"tsundere_lite\"]}},\"required\":[\"action\"]}}"
    ",{\"name\":\"read_file\",\"description\":"
    "\"Read a UTF-8 text file under /data/agent. Use it to open a skill "
    "document under /data/agent/skills before following that skill's "
    "steps.\",\"input_schema\":{\"type\":"
    "\"object\",\"properties\":{\"path\":{\"type\":\"string\"}},"
    "\"required\":[\"path\"]}}]");
}

static int product_tool_execute(const char *name, const char *input,
  char *output, size_t capacity, int (*check)(void *), void *context)
{
  cJSON *args = NULL;
  int ret;
  int written = 0;
  if (!name || (strcmp(name, "device_status") &&
                strcmp(name, "device_motion") &&
                strcmp(name, "device_control") && strcmp(name, "read_file")))
    {
      return ERROR;
    }

  if (!output || !capacity)
    {
      return ERROR;
    }

  output[0] = '\0';
  ret = check ? check(context) : 0;
  if (ret)
    {
      goto out;
    }

  if (!strcmp(name, "read_file"))
    {
      /* Reuses the official file tool to read a skill document; that tool
       * writes the success/failure text into output, and a failure is not
       * rewritten as a device error so the model can tell "skill not
       * readable" apart from "device operation failed".
       */

      ret = tool_read_file_execute(input ? input : "", output, capacity);
      syslog(LOG_INFO, "BKVOICE tool=read_file result=%d\n", ret);
      return OK;
    }

  args = input ? cJSON_Parse(input) : NULL;
  if (!cJSON_IsObject(args))
    {
      ret = -EINVAL;
      goto out;
    }

  if (!strcmp(name, "device_status"))
    {
      char voltage[16] = "null";
      char level[8] = "null";
      const char *state = "unknown";
      const char *mood =
      bk7258_preferences_persona_name(atomic_load(&g_active_persona));
      unsigned int volume;
#ifdef CONFIG_BK7258_HEALTH_SERVICE
      struct bk7258_health_service_snapshot_s health;
      if (!bk7258_health_service_snapshot(&health))
        {
          if (health.flags & BK7258_HEALTH_SNAPSHOT_BATTERY_VOLTAGE_VALID)
            {
              snprintf(voltage, sizeof(voltage), "%ld",
                       (long)health.battery_voltage_mv);
            }

          if (health.flags & BK7258_HEALTH_SNAPSHOT_BATTERY_STATE_VALID)
            {
              switch (health.battery_state)
                {
                  case BATTERY_FULL:
                    state = "full";
                    break;
                  case BATTERY_CHARGING:
                    state = "charging";
                    break;
                  case BATTERY_DISCHARGING:
                    state = "discharging";
                    break;
                  case BATTERY_IDLE:
                    state = "idle";
                    break;
                  case BATTERY_FAULT:
                    state = "fault";
                    break;
                }
            }
        }

#endif
      if (!bkvoice_media_volume(false, 0, &volume))
        {
          snprintf(level, sizeof(level), "%u", volume);
        }

      written = snprintf(output, capacity,
        "{\"battery_mv\":%s,\"battery_state\":\"%s\","
        "\"battery_percent\":null,\"battery_source\":\"periodic_cache\","
        "\"volume_percent\":%s,\"mood\":\"%s\"}",
        voltage, state, level, mood ? mood : "unknown");
    }
#ifdef CONFIG_BK7258_MOTION_SERVICE
  else if (!strcmp(name, "device_motion"))
    {
      struct bkmotion_rpc_response_s sample;
      ret = bk7258_motion_service_sample(&sample);
      if (!ret && sample.sensor_status < 0)
        {
          ret = sample.sensor_status;
        }

      if (ret)
        {
          goto out;
        }

      written = snprintf(output, capacity,
        "{\"sensor\":\"accelerometer\",\"gyroscope_available\":false,"
        "\"unit\":\"mm/s2\",\"timestamp_us\":%llu,"
        "\"x\":%ld,\"y\":%ld,\"z\":%ld}",
        (unsigned long long)sample.timestamp_us,
        (long)sample.x_mms2, (long)sample.y_mms2, (long)sample.z_mms2);
    }
#endif
  else if (!strcmp(name, "device_control"))
    {
      cJSON *action = cJSON_GetObjectItemCaseSensitive(args, "action");
      cJSON *value = cJSON_GetObjectItemCaseSensitive(args, "value");
      cJSON *mood = cJSON_GetObjectItemCaseSensitive(args, "mood");
      unsigned int observed = 0;
    if (bkagent_ota_busy())
      {
        ret = -EBUSY;
        goto out;
      }

