Embracecactus/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_agent_product.c
    ret = -EINVAL;
    if (!cJSON_IsString(action))
      {
        goto out;
      }

    /* The official Agent tool phase has already stopped capture and has not
     * started playback yet; the existing product owner is reused, the App's
     * control restriction on a busy turn is not relaxed, and GPIO is never
     * driven directly.
     */

      if (!strcmp(action->valuestring, "mood") && cJSON_IsString(mood))
        {
          for (int i = 0; i <= BK7258_PERSONA_TSUNDERE_LITE; i++)
            {
              if (!strcmp(mood->valuestring,
                          bk7258_preferences_persona_name(i)))
                {
                  ret = product_apply_persona(i);
                  break;
                }
            }
        }
#ifdef CONFIG_BK7258_DISPLAY_SERVICE
      else if (!strcmp(action->valuestring, "eyes"))
        {
          static const char *const expressions[] =
            {
              "neutral", "happy", "shy", "sad", "surprised", "thinking",
              "listening", "speaking", "sleepy"
            };

          cJSON *expression =
            cJSON_GetObjectItemCaseSensitive(args, "expression");
          if (cJSON_IsString(expression))
            {
              for (unsigned int i = 0;
                   i < sizeof(expressions) / sizeof(expressions[0]); i++)
                {
                  if (!strcmp(expression->valuestring, expressions[i]))
                    {
                      ret = bk7258_display_set_expression(expressions[i]);
                      break;
                    }
                }
            }
        }
#endif
      else if (cJSON_IsNumber(value) &&
               value->valuedouble == value->valueint &&
               value->valueint >= 0)
        {
          if (!strcmp(action->valuestring, "volume") &&
              value->valueint <= BK7258_TOOL_VALUE_MAX)
            {
              ret = bkvoice_media_volume(true, value->valueint, &observed);
              if (!ret)
                {
                  ret = bkvoice_volume_store_set(observed);
                }
            }
#ifdef CONFIG_BK7258_HAPTIC_SERVICE
          else if (!strcmp(action->valuestring, "vibrate") &&
                   value->valueint > 0 &&
                   value->valueint <= BK7258_TOOL_VALUE_MAX)
            {
              ret = bkhaptic_service_pulse_wait(value->valueint);
            }
#endif
        }

      if (ret)
        {
          goto out;
        }

      if (!strcmp(action->valuestring, "volume"))
        {
          written = snprintf(output, capacity,
                             "{\"ok\":true,\"volume_percent\":%u}",
                             observed);
        }
      else
        {
          written = snprintf(output, capacity,
                             "{\"ok\":true,\"action\":\"%s\"}",
                             action->valuestring);
        }
    }
  else
    {
      ret = -ENOTSUP;
    }

  if (!ret && (written < 0 || (size_t)written >= capacity))
    {
      ret = -ENOSPC;
    }

out:
  cJSON_Delete(args);
  if (ret)
    {
      snprintf(output, capacity,
               "Error: device operation failed (%d); do not claim success "
               "or invent a reading.", ret);
    }

  syslog(LOG_INFO, "BKVOICE device tool=%s result=%d\n", name, ret);
  return OK;
}

/* The authenticated control session reuses the single device scan worker.
 * Results are public SSIDs, scoped to this GATT generation, never credentials.
 */
static struct
{
  bool pending;
  bool ready;
  uint32_t generation;
  int result;
  size_t size;
  uint8_t wire[12 + BKPROV_SCAN_MAX_APS * 36];
} g_control_scan;

static void product_scan_step(void)
{
  if (g_control_scan.generation != bkprov_gatt_generation())
    {
      if (g_control_scan.pending) bkprov_scan_close();
      memset(&g_control_scan, 0, sizeof(g_control_scan));
      bkprov_scan_drain();
      return;
    }
  if (!g_control_scan.pending) return;
  struct bkprov_scan_result_s result;
  int ret = bkprov_scan_poll(&result);
  if (ret == -EAGAIN) return;
  g_control_scan.pending = false;
  g_control_scan.ready = true;
  g_control_scan.result = ret ? ret : result.status;
  if (g_control_scan.result) return;
  memset(g_control_scan.wire, 0, sizeof(g_control_scan.wire));
  memcpy(g_control_scan.wire, "WFS1", 4);
  g_control_scan.wire[4] = result.count;
  g_control_scan.wire[5] = result.truncated;
  for (unsigned int i = 0; i < result.count; i++)
    {
      uint8_t *p = g_control_scan.wire + 12 + i * 36;
      p[0] = result.aps[i].ssid_len;
      p[1] = (uint8_t)result.aps[i].rssi;
      p[2] = result.aps[i].channel;
      p[3] = result.aps[i].security;
      memcpy(p + 4, result.aps[i].ssid, 32);
    }
  g_control_scan.size = 12 + result.count * 36;
}

static int product_scan_read(uint32_t offset,
                            struct bkcontrol_status_s *status)
{
  product_scan_step();
  if (!offset && !g_control_scan.ready && !g_control_scan.pending)
    {
      if (bkprov_network_busy()) return -EBUSY;
      int ret = bkprov_scan_start();
      if (ret) return ret;
      g_control_scan.pending = true;
      g_control_scan.generation = bkprov_gatt_generation();
    }
  if (g_control_scan.pending) return -EAGAIN;
  if (!g_control_scan.ready) return -ESTALE;
  if (g_control_scan.result)
    {
      int ret = g_control_scan.result;
      g_control_scan.ready = false;
      return ret;
    }
  if (offset >= g_control_scan.size || (offset & 15u)) return -ERANGE;
  status->config_total = g_control_scan.size;
  size_t count = g_control_scan.size - offset;
  if (count > sizeof(status->config_chunk)) count = sizeof(status->config_chunk);
  memset(status->config_chunk, 0, sizeof(status->config_chunk));
  memcpy(status->config_chunk, g_control_scan.wire + offset, count);
  if (offset + count == g_control_scan.size) g_control_scan.ready = false;
  return 0;
}

static bool product_available(void *unused)
{
  (void)unused;
  return atomic_load(&g_agent_core_ready) &&
         atomic_load(&g_voice_initialized) &&
         !atomic_load(&g_probe_running) &&
         voice_channel_is_idle() &&
         !bkagent_ota_busy() && !bkprov_network_busy();
}

static int product_models(enum bkcontrol_command_e command, uint32_t offset,
  const uint8_t *record, size_t size, struct bkcontrol_status_s *status);

