Embracecactus/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_agent_product.c
static uint64_t product_be64(const uint8_t *record)
{
  uint64_t value = 0;
  for (unsigned int i = 0; i < 8; i++) value = (value << 8) | record[i];
  return value;
}

static void product_be32(uint8_t *record, uint32_t value)
{
  record[0] = value >> 24; record[1] = value >> 16;
  record[2] = value >> 8; record[3] = value;
}

/* SRT1 is accepted only after the existing storage worker has durably
 * committed SRV1.  The caller retries an exact request while it returns
 * -EAGAIN; no accepted request is inferred from a disconnected response. */
static int product_reset_control(enum bkcontrol_command_e command,
  uint32_t offset, const uint8_t *record, size_t size,
  struct bkcontrol_status_s *status)
{
  if (command == BKCONTROL_CONFIG_READ)
    {
      uint8_t wire[28] = {'S', 'R', 'S', '1'};
      if (offset >= sizeof(wire) || (offset & 15u) || record == NULL || size != 16)
        return -EINVAL;
      int receipt = bkprov_storage_reset_receipt(record);
      if (receipt < 0) return receipt;
      product_be32(wire + 4, receipt == BKPROV_STORAGE_RESET_RECEIPT_PENDING ? 1u :
                            receipt == BKPROV_STORAGE_RESET_RECEIPT_COMPLETED ? 2u : 0u);
      memcpy(wire + 12, record, 16);
      status->config_total = sizeof(wire);
      memset(status->config_chunk, 0, sizeof(status->config_chunk));
      size_t count = sizeof(wire) - offset;
      if (count > sizeof(status->config_chunk)) count = sizeof(status->config_chunk);
      memcpy(status->config_chunk, wire + offset, count);
      return 0;
    }
  if (command == BKCONTROL_CONFIG_BEGIN) return size == 32 ? 0 : -EMSGSIZE;
  if (command != BKCONTROL_CONFIG_APPLY || size != 32 || record == NULL ||
      memcmp(record, "SRT1", 4) || record[4] || record[5] || record[6] || record[7])
    return -EBADMSG;
  uint8_t nonzero = 0;
  for (unsigned int i = 16; i < 32; i++) nonzero |= record[i];
  if (!nonzero) return -EBADMSG;
  return bkprov_storage_reset_request(product_be64(record + 8), record + 16);
}

static int product_response_mode(enum bkcontrol_command_e command,
  uint32_t offset, const uint8_t *record, size_t size,
  struct bkcontrol_status_s *status)
{
#ifdef CONFIG_BK7258_PREFERENCES
  bool enabled = false;
  int ret = bk7258_preferences_thinking_get(&enabled);
  if (ret && ret != -EAGAIN)
    {
      return ret;
    }

  if (command == BKCONTROL_CONFIG_READ)
    {
      if (ret)
        {
          return ret;
        }

      if (offset)
        {
          return -ERANGE;
        }

      status->config_total = 12;
      memset(status->config_chunk, 0, sizeof(status->config_chunk));
      memcpy(status->config_chunk, "RSP1", 4);
      status->config_chunk[7] = enabled ? 1 : 0;
      return 0;
    }

  if (command != BKCONTROL_CONFIG_BEGIN && command != BKCONTROL_CONFIG_APPLY)
    {
      return -EINVAL;
    }

  if ((atomic_load(&g_voice_initialized) && !voice_channel_is_idle()) ||
      bkprov_network_busy())
    {
      return -EBUSY;
    }

  if (size != 12)
    {
      return -EMSGSIZE;
    }

  if (command == BKCONTROL_CONFIG_BEGIN)
    {
      return 0;
    }

  if (!record || memcmp(record, "RSP1", 4) || record[4] || record[5] ||
      record[6] || record[7] > 1 || record[8] || record[9] || record[10] ||
      record[11]) return -EBADMSG;
  bool requested = record[7] != 0;
  ret = bk7258_preferences_thinking_set(requested);
  if (!ret)
    {
      ret = bk7258_preferences_thinking_get(&enabled);
    }

  if (!ret && enabled != requested)
    {
      ret = -EIO;
    }

  if (!ret)
    {
      bkagent_cloud_set_thinking(enabled);
    }

  syslog(ret ? LOG_WARNING : LOG_INFO,
         "BKVOICE response mode thinking=%d saved=%d result=%d\n",
         requested, ret == 0, ret);
  return ret;
#else
  return -ENOTSUP;
#endif
}

static int product_wake_threshold(enum bkcontrol_command_e command,
  uint32_t offset, const uint8_t *record, size_t size,
  struct bkcontrol_status_s *status)
{
#ifdef CONFIG_BK7258_PREFERENCES
  if (command == BKCONTROL_CONFIG_READ)
    {
      if (offset)
        {
          return -ERANGE;
        }

      status->config_total = 12;
      memset(status->config_chunk, 0, sizeof(status->config_chunk));
      memcpy(status->config_chunk, "KWT1", 4);
      status->config_chunk[7] = bk7258_agent_trigger_threshold_get();
      return 0;
    }

  if (command != BKCONTROL_CONFIG_BEGIN && command != BKCONTROL_CONFIG_APPLY)
    {
      return -EINVAL;
    }

  if (!voice_channel_is_idle() || bk7258_agent_trigger_model_pending())
    {
      return -EBUSY;
    }

  if (size != 12)
    {
      return -EMSGSIZE;
    }

  if (command == BKCONTROL_CONFIG_BEGIN)
    {
      return 0;
    }

  if (!record || memcmp(record, "KWT1", 4) || record[4] || record[5] ||
      record[6] || record[7] < 50 || record[7] > 90 || record[8] ||
      record[9] || record[10] || record[11]) return -EBADMSG;
  unsigned int observed = 0;
  int ret = bk7258_preferences_wake_threshold_set(record[7]);
  if (!ret)
    {
      ret = bk7258_preferences_wake_threshold_get(&observed);
    }

  if (!ret && observed != record[7])
    {
      ret = -EIO;
    }

  if (!ret)
    {
      ret = bk7258_agent_trigger_threshold_set(observed);
    }

  syslog(ret ? LOG_WARNING : LOG_INFO,
         "BKVOICE wake threshold percent=%u saved=%d result=%d\n",
         record[7], ret == 0, ret);
  return ret;
#else
  return -ENOTSUP;
#endif
}

#ifdef CONFIG_BK7258_DISPLAY_SERVICE
static int product_asset_time(void *unused)
{
  uint64_t utc;
  (void)unused;
  return bkprov_time_get(0, &utc);
}

static int product_install_eyes(const uint8_t *record, size_t size)
{
  struct asset_download_s
  {
    struct bkcontrol_ota_request_s source;
    struct bkcloud_config_s endpoint;
    struct bkcloud_http_s http;
    struct bkvoice_tls_s tls;
    mbedtls_x509_crt ca;
    char data[131073];
  };

  struct asset_download_s *download = calloc(1, sizeof(*download));

  if (!download)
    {
      return -ENOMEM;
    }

  uint32_t generation = bkprov_gatt_generation();
  mbedtls_x509_crt_init(&download->ca);
  int ret = bkcontrol_eye_request_parse(record, size, &download->source);
  char scheme[8];
  char path[256];
  struct url_s url =
    {
      .scheme = scheme, .schemelen = sizeof(scheme),
      .host = download->endpoint.host,
      .hostlen = sizeof(download->endpoint.host),
      .port = 443, .path = path, .pathlen = sizeof(path)
    };

