Embracecactus/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_agent_product.c
  if (!ret)
    {
      ret = netlib_parseurl(download->source.url, &url);
    }

  if (!ret)
    {
      download->endpoint.port = url.port;
      ret = mbedtls_x509_crt_parse(&download->ca,
          (const unsigned char *)download->source.ca_pem,
          strlen(download->source.ca_pem) + 1);
      if (ret)
        {
          ret = -EKEYREJECTED;
        }
    }

  struct bkvoice_tls_config_s tls =
    {
      .server_ca = &download->ca,
      .trusted_time = product_asset_time, .now_ms = bkvoice_config_now_ms,
      .server_auth_only = true
    };

  memcpy(&tls.peer_address.s_addr, download->source.ipv4, 4);
  if (!ret)
    {
      ret = bkvoice_tls_initialize(&download->tls, &tls);
    }

  if (!ret) ret = bkcloud_http_get(&download->http, &download->endpoint,
      download->source.url, bkvoice_tls_ops(), &download->tls,
      bkvoice_config_now_ms(NULL) + 8000, download->data,
      sizeof(download->data));
  uint8_t digest[32];
  if (!ret && download->http.received < 128)
    {
      ret = -EBADMSG;
    }

  if (!ret) ret = mbedtls_sha256((const unsigned char *)download->data,
                                download->http.received, digest, 0);
  if (!ret && memcmp(digest, download->source.catalog_sha256,
                     sizeof(digest)))
    ret = -EBADMSG;
  /* Resources are not activated once the control connection is gone; the
   * download borrows no cloud session and changes no firmware update state.
   */

  if (!ret && generation != bkprov_gatt_generation())
    {
      ret = -ECANCELED;
    }

  if (download->tls.initialized)
    {
      bkvoice_tls_uninitialize(&download->tls);
    }

  if (!ret)
    {
      ret = bk7258_display_import(download->data, download->http.received);
    }

  syslog(ret ? LOG_WARNING : LOG_INFO,
      "BKDISPLAY APP IMPORT transport=https result=%d bytes=%u\n",
      ret, (unsigned int)download->http.received);
  mbedtls_x509_crt_free(&download->ca);
  free(download);
  return ret;
}
#endif

static int product_config(void *context, enum bkcontrol_command_e command,
  uint32_t kind, uint32_t offset, const uint8_t *record, size_t size,
  struct bkcontrol_status_s *status)
{
  if (bkagent_ota_busy())
    {
      return -EBUSY;
    }

  if (kind == BKCONTROL_CONFIG_FOCUS)
    {
      return bkfocus_control(command, offset, record, size, status,
                             bkvoice_config_now_ms(NULL));
    }

  if (kind == BKCONTROL_CONFIG_SETTINGS)
    {
      return bkprov_config_control(command, offset, record, size, status);
    }

  if (kind == BKCONTROL_CONFIG_WIFI_SCAN)
    {
      return command == BKCONTROL_CONFIG_READ ?
        product_scan_read(offset, status) : -EINVAL;
    }

  if (kind == BKCONTROL_CONFIG_RESET_TRANSFER)
    {
      return product_reset_control(command, offset, record, size, status);
    }

  if (kind == BKCONTROL_CONFIG_CLOUD_MODELS)
    {
      return product_models(command, offset, record, size, status);
    }

  if (kind == BKCONTROL_CONFIG_RESPONSE_MODE)
    {
      return product_response_mode(command, offset, record, size, status);
    }

  if (kind == BKCONTROL_CONFIG_WAKE_THRESHOLD)
    {
      return product_wake_threshold(command, offset, record, size, status);
    }

#ifdef CONFIG_BK7258_DISPLAY_SERVICE
  if (kind == BKCONTROL_CONFIG_EYE_PACK)
    {
      if (command == BKCONTROL_CONFIG_READ)
        {
          struct bkdisplay_service_status_s display;
          uint8_t wire[108] =
            {
              'E', 'Y', 'E', '1'
            };

          int ret = bk7258_display_get_status(&display);
          if (ret)
            {
              return ret;
            }

          uint32_t fields[] =
            {
              display.state, (uint32_t)display.last_error,
              display.pack_revision, display.render_sequence
            };

          for (unsigned int i = 0; i < 4; i++)
            {
              for (unsigned int byte = 0; byte < 4; byte++)
                {
                  wire[4 + i * 4 + byte] = fields[i] >> (24 - byte * 8);
                }
            }

          memcpy(wire + 20, display.pack_id, sizeof(display.pack_id));
          memcpy(wire + 52, display.source_sha256,
                 sizeof(display.source_sha256));
          memcpy(wire + 84, display.expression, sizeof(display.expression));
          if (offset >= sizeof(wire) || (offset & 15u))
            {
              return -ERANGE;
            }

          size_t count = sizeof(wire) - offset;
          if (count > sizeof(status->config_chunk))
            {
              count = sizeof(status->config_chunk);
            }

          status->config_total = sizeof(wire);
          memset(status->config_chunk, 0, sizeof(status->config_chunk));
          memcpy(status->config_chunk, wire + offset, count);
          return 0;
        }

      if (command != BKCONTROL_CONFIG_BEGIN &&
          command != BKCONTROL_CONFIG_APPLY)
        {
          return -EINVAL;
        }

      if (size < 44 || size > BKCONTROL_OTA_RECORD_MAX)
        {
          return -EMSGSIZE;
        }

      if (!voice_channel_is_idle() || bkprov_network_busy() ||
          bk7258_agent_trigger_model_pending()) return -EBUSY;
      if (command == BKCONTROL_CONFIG_BEGIN)
        {
          return 0;
        }

      return product_install_eyes(record, size);
    }

#endif
  return bk7258_agent_trigger_control(context, command, kind, offset,
                                     record, size, status);
}

#ifdef BKAGENT_APP_OTA_ENABLED
static int product_ota(void *context, enum bkcontrol_command_e command,
  const uint8_t *record, size_t size, struct bkcontrol_status_s *status)
{
  if (command == BKCONTROL_OTA_START)
    {
      if (bkagent_ota_busy() || !g_identity_bound ||
          !voice_channel_is_idle() || bkprov_network_busy() ||
          bk7258_agent_trigger_model_pending()) return -EBUSY;
      int ret = 0;
      if (g_trigger_started)
        {
          ret = bk7258_agent_trigger_stop();
          if (ret)
            {
              return ret;
            }

          g_trigger_started = false;
        }

      atomic_store(&g_trigger_prepare_pending, true);
    }

  return bkagent_ota_control(context, command, record, size, status);
}
#endif

static int product_load_legacy(void *unused, const void *data, size_t size)
{
  (void)unused;
  (void)data;
  (void)size;
  return -ENOTSUP;
}

