Embracecactus/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_agent_product.c
static int product_load_cloud_models(const void *trust, size_t trust_size,
                                     const void *cloud, size_t cloud_size,
                                     const struct bkcloud_models_s *models)
{
  struct bkcloud_config_s *decoded = calloc(1, sizeof(*decoded));
  if (!decoded)
    {
      return -ENOMEM;
    }

  int ret = bkcloud_config_decode(decoded, cloud, cloud_size);
  if (!ret) ret = models ?
    bkagent_cloud_configure_models(trust, trust_size, cloud, cloud_size,
                                   models) :
    bkagent_cloud_configure(trust, trust_size, cloud, cloud_size);
  if (!ret)
    {
      const char *backend = decoded->dialect == 2 ? "mimo" :
                            decoded->dialect == 1 ? "openai-audio" : NULL;
      char asr[64] =
        {
          0
        };

      char tts[64] =
        {
          0
        };

      char location[32] =
        {
          0
        };

      bool device_tts = false;
      if (!backend)
        {
          ret = -ENOTSUP;
        }

      if (!ret)
        {
          (void)claw_config_get("asr_backend", asr, sizeof(asr));
        }

      if (!ret) (void)claw_config_get(AGENT_CFG_KEY_TTS_BACKEND,
                                     tts, sizeof(tts));
      if (!ret) (void)claw_config_get(AGENT_CFG_KEY_TTS_LOCATION,
                                     location, sizeof(location));
      if (!ret && asr[0] && strcmp(asr, backend) && strcmp(asr, "funasr"))
        {
          ret = -EPERM;
        }

      if (!ret && !asr[0])
        {
          snprintf(asr, sizeof(asr), "%s", backend);
        }

      if (!ret && (!location[0] || !strcmp(location, "remote")))
        {
          if (tts[0] && strcmp(tts, backend))
            {
              ret = -EPERM;
            }
          else if (!tts[0])
            {
              snprintf(tts, sizeof(tts), "%s", backend);
            }
        }
      else if (!ret && !strcmp(location, "device"))
        {
          device_tts = true;
          if (!tts[0] || !strcmp(tts, backend))
            {
              ret = -ENOTSUP;
            }
        }
      else if (!ret)
        {
          ret = -EINVAL;
        }

      if (!ret)
        {
          ret = bkagent_cloud_prepare_asr(asr);
        }

      if (!ret)
        {
          ret = voice_asr_set_backend(asr);
        }

      syslog(ret ? LOG_WARNING : LOG_INFO,
             "BKVOICE ASR activation backend=%s result=%d\n", asr, ret);
      if (!ret)
        {
          ret = bkagent_cloud_activate_llm();
        }

      syslog(ret ? LOG_WARNING : LOG_INFO,
             "BKVOICE LLM activation result=%d\n", ret);
      if (!ret)
        {
          ret = tts[0] ? voice_tts_set_backend(tts) : -ENOTSUP;
        }

      if (!ret)
        {
          voice_tts_capabilities_t caps;
          ret = voice_tts_get_capabilities(&caps);
          if (!ret && (device_tts ?
              caps.location != VOICE_TTS_LOCATION_DEVICE ||
              caps.needs_network :
              caps.location != VOICE_TTS_LOCATION_REMOTE ||
              !caps.needs_network))
            {
              ret = -EPERM;
            }
        }

      syslog(ret ? LOG_WARNING : LOG_INFO,
             "BKVOICE TTS activation backend=%s location=%s result=%d\n",
             tts, device_tts ? "device" : "remote", ret);
    }

  g_cloud_loaded = ret == 0;
  g_service_result = ret ? ret : -EAGAIN;
  g_probe_result = g_service_result;
  bkcloud_config_clear(decoded);
  free(decoded);
  return ret;
}

static int product_load_cloud(void *unused, const void *trust,
                              size_t trust_size, const void *cloud,
                              size_t cloud_size)
{
  (void)unused;
  if (!g_save_first)
    return product_load_cloud_models(trust, trust_size, cloud, cloud_size, NULL);
  /* SCB4 is authoritative: an old separate preferences override must not
   * silently replace models just saved through the authenticated editor. */
  struct bkcloud_config_s *decoded = calloc(1, sizeof(*decoded));
  if (!decoded) return -ENOMEM;
  struct bkcloud_models_s models = {0};
  int ret = bkcloud_config_decode(decoded, cloud, cloud_size);
  if (!ret)
    {
      memcpy(models.asr_model, decoded->asr_model, sizeof(models.asr_model));
      memcpy(models.chat_model, decoded->chat_model, sizeof(models.chat_model));
      memcpy(models.tts_model, decoded->tts_model, sizeof(models.tts_model));
      ret = product_load_cloud_models(trust, trust_size, cloud, cloud_size, &models);
    }
  bkcloud_config_clear(decoded);
  free(decoded);
  return ret;
}

static int product_models(enum bkcontrol_command_e command, uint32_t offset,
  const uint8_t *record, size_t size, struct bkcontrol_status_s *status)
{
  struct bkcloud_models_s models =
    {
      0
    };

  struct bkcloud_models_s previous =
    {
      0
    };

  int ret;
  if (command == BKCONTROL_CONFIG_READ)
    {
      uint8_t wire[BKCLOUD_MODELS_RECORD_MAX];
      size_t total = 0;
      if (!g_cloud_loaded)
        {
          return g_product_error ? g_product_error : -EAGAIN;
        }

      ret = bkagent_cloud_models_get(&models);
      if (!ret)
        {
          ret = bkcloud_models_encode(&models, wire, sizeof(wire), &total);
        }

      if (ret)
        {
          return ret;
        }

      if (offset >= total || (offset & 15u))
        {
          return -ERANGE;
        }

      status->config_total = total;
      memset(status->config_chunk, 0, sizeof(status->config_chunk));
      size_t count = total - offset;
      if (count > sizeof(status->config_chunk))
        {
          count = sizeof(status->config_chunk);
        }

      memcpy(status->config_chunk, wire + offset, count);
      return 0;
    }

  if (command != BKCONTROL_CONFIG_BEGIN && command != BKCONTROL_CONFIG_APPLY)
    {
      return -EINVAL;
    }

  if (g_save_first) return -ENOTSUP; /* Use the independent SCP1 settings editor. */
  if (atomic_load(&g_probe_running)) return -EBUSY;
  if (size < 12 || size > BKCLOUD_MODELS_RECORD_MAX)
    {
      return -EMSGSIZE;
    }

  if (!g_identity_bound)
    {
      return -ENOKEY;
    }

  if (!voice_channel_is_idle() || bkprov_network_busy() ||
      bk7258_agent_trigger_model_pending()) return -EBUSY;
  if (command == BKCONTROL_CONFIG_BEGIN)
    {
      return 0;
    }

  ret = bkcloud_models_decode(&models, record, size);
  if (ret)
    {
      return ret;
    }

  if (!g_cloud_loaded)
    {
      return g_product_error ? g_product_error : -EAGAIN;
    }

  ret = bkagent_cloud_models_get(&previous);
  if (ret)
    {
      return ret;
    }

  /* Reuse the accepted protected configuration and the normal backend
   * activation path. This changes public model names, never Wi-Fi, trust,
   * identity or the independent choice of a local TTS backend.
   */

