Embracecactus/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_agent_product.c
  struct model_workspace_s
  {
    uint8_t bundle[BKPROV_BUNDLE_MAX];
    uint8_t voice[BKVOICE_CONFIG_MAX_BYTES];
    uint8_t transaction[16];
    struct bkprov_settings_s settings;
  };

  struct model_workspace_s *work = calloc(1, sizeof(*work));

  if (!work)
    {
      return -ENOMEM;
    }

  size_t bundle_size = 0;
  size_t voice_size = 0;
  uint64_t revision = 0;
  ret = bkprov_storage_snapshot(work->bundle, sizeof(work->bundle),
                                &bundle_size, &revision, work->transaction);
  if (!ret && revision != g_config_revision)
    {
      ret = -EAGAIN;
    }

  if (!ret)
    {
      ret = bkprov_settings_decode(&work->settings, work->bundle,
                                   bundle_size);
    }

  if (!ret && !work->settings.cloud_size)
    {
      ret = -ENOTSUP;
    }

  /* The persisted UTC is a floor, not the current time. Match the existing
   * restore path before the config loader installs a fresh clock anchor.
   */

  if (!ret)
    {
      ret = bkprov_time_get(work->settings.utc, &work->settings.utc);
    }

  if (!ret) ret = bkprov_settings_voice(&work->settings,
    g_identity.record + 48, g_identity.certificate_size,
    g_identity.record + 48 + g_identity.certificate_size,
    g_identity.key_size, work->voice, sizeof(work->voice), &voice_size);
  if (!ret && g_trigger_started)
    {
      ret = bk7258_agent_trigger_stop();
      if (!ret)
        {
          g_trigger_started = false;
        }
    }

  if (!ret)
    {
      g_configured = false;
      ret = product_load_cloud_models(work->voice, voice_size,
        work->settings.cloud, work->settings.cloud_size, &models);
      if (!ret)
        {
          g_probe_result = bkagent_cloud_verify_service();
          g_service_result = g_probe_result;
          ret = g_probe_result;
        }

      if (!ret)
        {
          ret = bk7258_preferences_cloud_models_set(&models);
        }

      if (!ret)
        {
          g_configured = g_service_result == 0;
        }
      else
        {
          int failure = ret;
          int restored = product_load_cloud_models(work->voice, voice_size,
            work->settings.cloud, work->settings.cloud_size, &previous);
          if (!restored)
            {
              g_probe_result = bkagent_cloud_verify_service();
              g_service_result = g_probe_result;
              restored = g_probe_result;
            }

          g_configured = restored == 0;
          if (restored)
            {
              ret = restored;
            }
          else ret = failure;
          syslog(restored ? LOG_ERR : LOG_WARNING,
                 "BKVOICE cloud model rollback candidate=%d restored=%d\n",
                 failure, restored);
        }
    }

  g_product_error = ret;
  mbedtls_platform_zeroize(&previous, sizeof(previous));
  mbedtls_platform_zeroize(&models, sizeof(models));
  mbedtls_platform_zeroize(work, sizeof(*work));
  free(work);
  syslog(ret ? LOG_WARNING : LOG_INFO,
         "BKVOICE cloud model apply result=%d ready=%d\n",
         ret, g_configured);
  return ret;
}

static void *product_probe_worker(void *unused)
{
  (void)unused;
  int ret = bkagent_cloud_verify_service();
  atomic_store(&g_probe_worker_result, ret);
  atomic_store(&g_probe_running, false);
  bk7258_agent_product_wake();
  return NULL;
}

static int product_connect(void *unused)
{
  pthread_attr_t attr;
  pthread_t thread;
  int ret;
  bool expected = false;
  (void)unused;
  if (!atomic_compare_exchange_strong(&g_probe_running, &expected, true))
    return -EBUSY;
  g_probe_result = -EAGAIN;
  atomic_store(&g_probe_worker_result, -EAGAIN);
  ret = pthread_attr_init(&attr);
  if (ret == 0)
    {
      ret = pthread_attr_setdetachstate(&attr, PTHREAD_CREATE_DETACHED);
      if (ret == 0) ret = pthread_attr_setstacksize(&attr, 8192);
      if (ret == 0)
        ret = pthread_create(&thread, &attr, product_probe_worker, NULL);
      pthread_attr_destroy(&attr);
    }

  if (ret != 0) atomic_store(&g_probe_running, false);
  return -ret;
}

static int product_ready(void *unused)
{
  (void)unused;
  if (atomic_load(&g_probe_running)) return 0;
  g_probe_result = atomic_load(&g_probe_worker_result);
  g_service_result = g_probe_result;
  return g_probe_result == 0 ? 1 : g_probe_result;
}

static int product_clear(void *unused)
{
  (void)unused;
  if (atomic_load(&g_probe_running) ||
      (atomic_load(&g_voice_initialized) && !voice_channel_is_idle()))
    {
      return -EBUSY;
    }

  if (g_trigger_started)
    {
      int ret = bk7258_agent_trigger_stop();
      if (ret < 0)
        {
          return ret;
        }

      g_trigger_started = false;
    }

  int ret = bkagent_cloud_clear();
  if (ret < 0)
    {
      return ret;
    }

  g_configured = false;
  g_cloud_loaded = false;
  g_service_result = -ENOTCONN;
  g_probe_result = -ENOTCONN;
  atomic_store(&g_trigger_prepare_pending, true);
  return 0;
}

/* Runs only after the product loop closed the old authenticated window,
 * cancelled its network writer and stopped the trigger/cloud writers. The
 * storage worker keeps SRV1 selected when any replica cannot be cleaned. */
static int product_reset_cleanup(void)
{
  int ret;
  if (g_trigger_started || atomic_load(&g_probe_running) ||
      (atomic_load(&g_voice_initialized) && !voice_channel_is_idle()))
    return -EBUSY;
#ifdef CONFIG_BK7258_PREFERENCES
  ret = bkagent_memory_reset();
  if (ret < 0) return ret;
  ret = bk7258_preferences_reset();
  if (ret < 0) return ret;
#endif
#ifdef CONFIG_BK7258_DISPLAY_SERVICE
  ret = bk7258_display_reset_selection();
  if (ret < 0) return ret;
#endif
  return 0;
}

/* A persisted SRV1 revokes the old control immediately. Until cleanup and
 * SRR1 completion, uncertainty remains quiesced and no new window opens. */
static int product_reset_step(void)
{
  int pending = bkprov_storage_reset_pending();
  /* Storage loading is a normal boot condition, not evidence of SRV1. Do not
   * consume a real TURN_COMPLETE or block bootstrap merely because its worker
   * has not published a snapshot yet. Other read failures remain fail-closed
   * to callers, but never enter destructive reset cleanup without a marker. */
  if (g_reset_phase == PRODUCT_RESET_IDLE &&
      (pending == -EAGAIN || pending == -ENODEV)) return 0;
  if (pending == 0 && g_reset_phase != PRODUCT_RESET_FINISHING) return 0;
  if (pending != 1 &&
      !(pending == 0 && g_reset_phase == PRODUCT_RESET_FINISHING)) return pending;
  int ret;
  if (g_reset_phase != PRODUCT_RESET_FINISHING)
    {
      g_reset_phase = PRODUCT_RESET_QUIESCING;
      ret = bkprov_owner_quiesce(true);
      if (ret < 0) return ret;
      ret = bkprov_network_cancel();
      if (ret < 0 && ret != -EAGAIN) return ret;
      bkprov_network_step();
      if (bkprov_network_busy()) return -EAGAIN;
      if (atomic_load(&g_voice_initialized) && !voice_channel_is_idle())
        {
          voice_channel_cancel();
          /* 撤销门禁跳过普通循环，仍须由原所有者完成延迟资源回收。 */
          (void)voice_channel_recover();
          return -EAGAIN;
        }
      ret = product_clear(NULL);
      if (ret < 0) return ret;
      g_reset_phase = PRODUCT_RESET_FINISHING;
      ret = bkprov_storage_reset_finish(product_reset_cleanup);
      if (ret < 0) return ret;
    }
  else if (pending == 1)
    {
      /* Publish the worker's actual cleanup result. A failed worker must not
       * be hidden as another ordinary retry while SRV1 is still selected. */
      ret = bkprov_storage_reset_finish(product_reset_cleanup);
      if (ret < 0) return ret;
    }
  /* A successful worker changes reset_pending() to zero before this code
   * runs again. FINISHING deliberately owns that handoff. */
  if (pending == 1) return -EAGAIN;
  ret = bkprov_owner_unbind();
  if (ret < 0) return ret;
  ret = bkprov_network_unbind();
  if (ret < 0) return ret;
  bkprov_identity_clear(&g_identity);
  g_identity_bound = false;
  g_control_bound = false;
  g_configured = false;
  g_cloud_loaded = false;
  g_config_revision = 0;
  atomic_store(&g_active_persona, -1);
  atomic_store(&g_trigger_prepare_pending, true);
  (void)bkprov_owner_quiesce(false);
  g_reset_phase = PRODUCT_RESET_IDLE;
  return 1;
}

static const struct bkprov_voice_ops_s g_provision_voice =
{
  product_available, product_load_legacy, product_connect, product_ready,
  product_clear, product_load_cloud
};

static bool g_capture_route_negotiated;

static int product_capture_prepare(unsigned int rate, unsigned int channels,
                                   unsigned int bits)
{
  /* The product graph and all its capture consumers share this fixed format.
   * Never warm-start a new/unnegotiated format using a previous route. */
  if (rate != 16000 || channels != 1 || bits != 16) return -ENOTSUP;
  if (!g_capture_route_negotiated) return 0;
  int ret = bkvoice_media_source_prepare_warm(MEDIA_SOURCE_MIC);
  return ret < 0 ? ret : 1;
}

static int product_capture_route(int active)
{
  int ret = bkvoice_media_source_set_active(MEDIA_SOURCE_MIC, active != 0);
  if (!ret && active) g_capture_route_negotiated = true;
  return ret;
}

/* One bounded, zeroized workspace for protected storage reads. Parsed
 * identity owns its own allocation; settings borrow only this workspace.
 */

struct agent_config_workspace_s
{
  uint8_t bundle[BKPROV_BUNDLE_MAX];
  uint8_t identity[8192];
  struct bkprov_settings_s settings;
};

