Embracecactus/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_agent_product.c
static bool storage_unavailable(int result)
{
  return result == -ENODEV || result == -ENOTCONN ||
         result == -EXDEV || result == -ETIMEDOUT;
}

static int bk7258_agent_activate_cloud(bool *storage_waiting)
{
  *storage_waiting = false;
  if (bkprov_owner_pairing() || bkprov_network_busy())
    {
      return -EBUSY;
    }

  struct agent_config_workspace_s *work = calloc(1, sizeof(*work));
  if (!work)
    {
      return -ENOMEM;
    }

  size_t size = 0;
  uint64_t revision = 0;
  uint8_t transaction[16] =
    {
      0
    };

  int ret = 0;
  if (!g_identity_bound)
    {
#ifdef CONFIG_BK7258_PROVISION_NATIVE
      ret = bkprov_bootstrap_status();
      if (ret < 0) { *storage_waiting = true; goto out; }
#endif
      ret = bkprov_storage_identity(work->identity,
                                  sizeof(work->identity), &size);
      *storage_waiting = storage_unavailable(ret);
      if (!ret)
        {
          ret = bkprov_identity_load(&g_identity, work->identity, size);
        }

      if (!ret)
        {
          ret = bkprov_network_bind(&g_identity, &g_provision_voice, NULL);
        }

      if (!ret) ret = bkprov_owner_bind(&g_identity.certificate,
                                        &g_identity.key, g_identity.secret,
                                        bkprov_network_ops(), NULL);
      if (ret < 0)
        {
          (void)bkprov_network_unbind();
          bkprov_identity_clear(&g_identity);
          goto out;
        }

#ifdef CONFIG_BK7258_PROVISION_NATIVE
      if (g_identity.generated)
        ret = bkprov_owner_window_handler(bkprov_bootstrap_window, &g_identity);
      if (ret < 0) { (void)bkprov_owner_unbind(); goto out; }
#endif
      g_identity_bound = true;
    }

  ret = bkprov_storage_snapshot(work->bundle, sizeof(work->bundle), &size,
                                &revision, transaction);
  *storage_waiting = storage_unavailable(ret);
  if (ret < 0)
    {
      goto out;
    }

  ret = bkprov_settings_decode(&work->settings, work->bundle, size);
  if (ret < 0)
    {
      goto out;
    }

  if (!work->settings.control_key)
    {
      ret = -ENOKEY;
      goto out;
    }

  if (!g_control_bound)
    {
    ret = bkprov_owner_control(work->settings.control_key, product_control,
                               NULL);
    if (!ret)
      {
        ret = bkprov_owner_control_config(product_config);
      }

  #ifdef BKAGENT_APP_OTA_ENABLED
    if (!ret)
      {
        ret = bkprov_owner_control_ota(product_ota);
      }

  #endif
    if (ret < 0)
      {
        goto out;
      }

      g_control_bound = true;
    }

#ifdef CONFIG_BK7258_PREFERENCES
  (void)bkagent_memory_bind(work->settings.control_key);
#endif
  g_save_first = work->settings.deferred;
  if (!work->settings.ssid[0])
    {
      g_config_revision = revision;
      g_configured = false;
      ret = 0;
      goto out;
    }

  if (!atomic_load(&g_agent_core_ready) ||
      !atomic_load(&g_voice_initialized))
    {
      ret = -EBUSY;
      goto out;
    }

  if (g_configured && revision == g_config_revision)
    {
      goto out;
    }

  ret = product_clear(NULL);
  if (!ret)
    {
      ret = bkprov_network_restore(work->bundle, size);
    }

  if (!ret)
    {
      g_config_revision = revision;
    }

out:
  mbedtls_platform_zeroize(work, sizeof(*work));
  free(work);
  return ret;
}

static int bk7258_agent_config_task(int argc, FAR char *argv[])
{
  enum voice_action_e
    {
      VOICE_ACTION_NONE = 0,
      VOICE_ACTION_CONTINUE,
      VOICE_ACTION_REARM
    };

  bool pending = true;
  bool network_was_busy = false;
  bool storage_waiting = false;
  bool voice_interaction_active = false;
  bool preferences_pending = false;
  uint32_t connection_generation = bkprov_gatt_generation();
  uint64_t link_check_at = 0;
  bool link_expected = false;
#ifdef CONFIG_BK7258_PROVISION_NATIVE
  int bootstrap_observed = -EAGAIN;
#endif
  uint64_t storage_deadline = 0;
  uint64_t storage_retry_at = 0;
  uint64_t voice_cleanup_at = 0;
  uint64_t voice_action_at = 0;
  uint64_t preferences_retry_at = 0;
  uint64_t trigger_retry_at = 0;
  uint64_t network_retry_at = 0;
  uint32_t network_backoff = 5000;
  int voice_turn_result = 0;
  enum voice_action_e voice_action = VOICE_ACTION_NONE;
  (void)argc; (void)argv;
  while (1)
    {
      /* The existing BLE TLS/claim and Wi-Fi trial owners need their
       * documented step cadence. Configuration activation itself is
       * event driven.
       */

      struct timespec deadline;
      clock_gettime(CLOCK_REALTIME, &deadline);
      deadline.tv_nsec += 20000000;
      if (deadline.tv_nsec >= 1000000000)
        {
          deadline.tv_sec++;
          deadline.tv_nsec -= 1000000000;
        }

      int waited;
      do
        {
          waited = sem_timedwait(&g_product_wake, &deadline);
        }
      while (waited < 0 && errno == EINTR);

      if (waited < 0 && errno != ETIMEDOUT)
        {
          return -errno;
        }

      unsigned int events = atomic_exchange(&g_product_events, 0);
      bkagent_ota_poll();
      product_scan_step();
      uint64_t now = bkvoice_config_now_ms(NULL);
      int reset = product_reset_step();
      if (reset)
        {
          if (reset > 0 || g_reset_phase != PRODUCT_RESET_IDLE)
            {
              /* Do this before TURN_COMPLETE or preference recovery can
               * revive an owner that SRV1 has already revoked. */
              bkfocus_cancel();
#ifdef CONFIG_BK7258_DISPLAY_SERVICE
              bk7258_display_focus(0);
#endif
              voice_action = VOICE_ACTION_NONE;
              voice_interaction_active = false;
              preferences_pending = false;
              /* 完成撤销后必须重新绑定保留的设备身份；bootstrap 状态
               * 未必变化，不能依赖一次已被消费的存储通知。 */
              pending = reset == 1;
              link_expected = false;
              network_was_busy = false;
              events = 0;
              (void)atomic_exchange(&g_product_events, 0);
            }
          else
            {
              /* 未确认撤销的读取故障阻止新工作，但不吞掉完成通知。 */
              atomic_fetch_or(&g_product_events, events);
            }
          if (reset != -EAGAIN && reset != 1) g_product_error = reset;
          continue;
        }
#ifdef CONFIG_BK7258_PRODUCT_KEYS
      if (product_keys_step(now))
        {
          bkfocus_cancel();
#ifdef CONFIG_BK7258_DISPLAY_SERVICE
          bk7258_display_focus(0);
#endif
          /* Retain completion events while shutdown is pending or failed.
           * A failure keeps admission closed until an explicit retry; a
           * durable configuration or canceled voice result is not discarded.
           */
          atomic_fetch_or(&g_product_events, events);
          continue;
        }

#endif
      (void)bkfocus_step(now);
#ifdef CONFIG_BK7258_DISPLAY_SERVICE
      bk7258_display_focus(atomic_load(&g_voice_initialized) && !voice_channel_is_idle() ?
                          0 : bkfocus_visual(now));
#endif
      if (now >= voice_cleanup_at)
        {
          int cleanup = voice_channel_recover();
          voice_cleanup_at = now + 500;
          if (cleanup < 0 && cleanup != -EBUSY)
            {
              g_product_error = cleanup;
            }
        }

