Embracecactus/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_agent_product.c
      if (events & 2)
        {
          voice_turn_result = atomic_load(&g_voice_event_result);
          g_product_error = voice_turn_result;
          /* TURN_COMPLETE is the official per-turn resource boundary, not
           * the product interaction boundary. One admitted wake keeps
           * using official automatic turns until the official endpoint or
           * cancel outcome exits.
           */

          voice_action = voice_interaction_active &&
                         !product_voice_result_exits_interaction(
                           voice_turn_result) ?
                         VOICE_ACTION_CONTINUE : VOICE_ACTION_REARM;
          if (voice_action == VOICE_ACTION_REARM)
            voice_interaction_active = false;
          voice_action_at = now;
        }

      if (voice_action != VOICE_ACTION_NONE && now >= voice_action_at)
        {
          enum voice_action_e attempted = voice_action;
          int action;
          if (voice_action == VOICE_ACTION_CONTINUE)
            {
              action = voice_channel_start_auto();
            }
          else
            {
              action = bk7258_agent_trigger_rearm();
            }

          if (action == 0 || (voice_action == VOICE_ACTION_REARM &&
                              bk7258_agent_trigger_armed()))
            {
              voice_action = VOICE_ACTION_NONE;
            }
          else
            {
              if (voice_action == VOICE_ACTION_CONTINUE && action != -EBUSY)
                {
                  voice_interaction_active = false;
                  voice_action = VOICE_ACTION_REARM;
                }

              voice_action_at = now + 100;
              g_product_error = action;
            }

          syslog(action ? LOG_WARNING : LOG_INFO,
                 "BKVOICE turn complete=%d interaction=%s next=%s "
                 "result=%d\n",
                 voice_turn_result,
                 attempted == VOICE_ACTION_REARM ? "exit" : "active",
                 attempted == VOICE_ACTION_REARM ? "wake" : "capture",
               action);
        }

      if (events & 8)
        {
          pending = true;
          network_retry_at = 0;
          network_backoff = 5000;
          atomic_store(&g_trigger_prepare_pending, true);
        }

      uint32_t generation = bkprov_gatt_generation();
      if (!storage_deadline)
        {
          storage_deadline = now + 15000;
        }

      if (generation != connection_generation)
        {
          connection_generation = generation;
          /* A later App connection can retry a mount that missed the
           * bounded startup window. It cannot bypass identity or trust
           * validation.
           */

          if (storage_waiting)
            {
              storage_deadline = now + 15000;
              storage_retry_at = now;
            }
        }

      if (storage_retry_at && now >= storage_retry_at)
        {
          storage_retry_at = 0;
          if (now >= storage_deadline)
            {
              syslog(LOG_WARNING,
                     "BKVOICE storage readiness window expired result=%d\n",
                     g_product_error);
            }
          else
            {
              int ret = bkprov_storage_refresh();
              if (ret == -EBUSY)
                {
                  storage_retry_at = now + 250;
                }
              else if (ret)
                {
                  g_product_error = ret;
                }

              /* The existing storage worker owns I/O and publishes
               * completion.
               */
            }
        }

#ifdef CONFIG_BK7258_PROVISION_NATIVE
      int bootstrap_now = bkprov_bootstrap_status();
      if (bootstrap_now != bootstrap_observed)
        {
          bootstrap_observed = bootstrap_now;
          if (bootstrap_now >= 0) pending = true;
        }
#endif
      bkprov_config_step();
      bkprov_network_step();
      bool network_busy = bkprov_network_busy();
      if (network_was_busy && !network_busy)
        {
          int network_result = bkprov_network_result();
          struct bk7258_wifi_result_s link = {0};
          if (bk7258_wifi_read_link(&link) == 0)
            link_expected = link.link_state == BK7258_WIFI_LINK_CONNECTED && link.ipaddr != 0;
          g_configured = network_result == 0 && g_service_result == 0;
          g_product_error = network_result ? network_result : g_service_result;
          if (network_result && network_result != -ECANCELED)
            {
              network_retry_at = now + network_backoff;
              if (network_backoff < 60000) network_backoff *= 2;
              if (network_backoff > 60000) network_backoff = 60000;
            }
          else if (network_result == 0)
            {
              network_retry_at = 0;
              network_backoff = 5000;
            }
          syslog(g_configured ? LOG_INFO : LOG_WARNING,
                 "BKVOICE configuration ready=%d result=%d revision=%llu\n",
                 g_configured, g_product_error,
                 (unsigned long long)g_config_revision);
        }

      network_was_busy = network_busy;
      if (link_expected && !network_busy && now >= link_check_at)
        {
          struct bk7258_wifi_result_s link = {0};
          link_check_at = now + 1000;
          if (bk7258_wifi_read_link(&link) == 0 &&
              link.link_state != BK7258_WIFI_LINK_CONNECTED)
            {
              link_expected = false;
              g_configured = false;
              g_service_result = -ENETDOWN;
              if (atomic_load(&g_voice_initialized)) voice_channel_cancel();
              network_retry_at = now + 1000;
              syslog(LOG_WARNING, "BKVOICE link lost; reconnect scheduled\n");
            }
        }
      if (network_retry_at && now >= network_retry_at)
        {
          network_retry_at = 0;
          pending = true;
        }
      if (pending && !bkagent_ota_busy() &&
          (!atomic_load(&g_voice_initialized) || voice_channel_is_idle()) &&
          !network_busy && !bkprov_owner_pairing())
        {
          int ret = bk7258_agent_activate_cloud(&storage_waiting);
          if (storage_waiting && now < storage_deadline)
            {
              storage_retry_at = now + 250;
            }
          else if (!storage_waiting)
            {
              storage_retry_at = 0;
            }

          pending = ret == -EBUSY;
          if (ret && !pending)
            {
              g_product_error = ret;
              syslog(LOG_WARNING,
                     "BKVOICE configuration unavailable result=%d\n", ret);
              /* 同步启动失败尚未创建网络 trial，不会产生 busy->idle。
               * 对暂态错误沿用退避，不能靠用户重填 Key 才重新激活。
               * 存储、配置格式和认证错误仍由原有恢复入口处理。
               */

              if (!storage_waiting &&
                  (ret == -EAGAIN || ret == -ENOMEM || ret == -EIO ||
                   ret == -ENETDOWN || ret == -ENETUNREACH ||
                   ret == -EHOSTUNREACH || ret == -ETIMEDOUT ||
                   ret == -ECONNRESET))
                {
                  network_retry_at = now + network_backoff;
                  if (network_backoff < 60000) network_backoff *= 2;
                  if (network_backoff > 60000) network_backoff = 60000;
                }
            }

          network_was_busy = bkprov_network_busy();
        }

      (void)bkprov_owner_step(bkvoice_config_now_ms(NULL), 0, false, false,
        !bkagent_ota_busy());
      if (!atomic_load(&g_agent_core_ready) ||
          !atomic_load(&g_voice_initialized) || bkagent_ota_busy())
        {
          continue;
        }

