Embracecactus/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_agent_product.c
      bool model_was_pending = bk7258_agent_trigger_model_pending();
      int model_result = bk7258_agent_trigger_model_step(g_configured);
      if (model_result < 0 && model_result != -EBUSY)
        {
          g_product_error = model_result;
        }

      if (model_was_pending && !bk7258_agent_trigger_model_pending() &&
          model_result == 0)
        {
          atomic_store(&g_trigger_prepare_pending, false);
        }

      /* Only after the existing storage worker has read the same-volume
       * identity can a missing model record be told apart from a mount that
       * is not ready. The built-in model is not selected early during the
       * start-up -EAGAIN window, which would cache a wrong revision 0.
       */

      if (atomic_load(&g_trigger_prepare_pending) && g_identity_bound &&
          !pending && !network_busy &&
          voice_channel_is_idle() && !bkprov_owner_busy() &&
          !bk7258_agent_trigger_model_pending())
        {
      int ret = bk7258_agent_trigger_prepare();
      if (ret != -EBUSY)
        {
          atomic_store(&g_trigger_prepare_pending, false);
        }

      if (ret < 0 && ret != -EBUSY)
        {
          g_product_error = ret;
        }

      syslog(ret ? LOG_WARNING : LOG_INFO,
             "BKVOICE wake model prepared=%d result=%d\n", ret == 0, ret);
    }

      if (!g_configured || pending || bkprov_network_busy())
        {
          continue;
        }

      /* Display start-up briefly occupies the same SD; only the busy
       * resource is retried, and it is not mistaken for lost
       * configuration.
       */

      if ((!g_trigger_started || preferences_pending) &&
          !voice_interaction_active && voice_channel_is_idle() &&
          now >= preferences_retry_at)
        {
          preferences_pending = false;
#ifdef CONFIG_BK7258_PREFERENCES
          unsigned int threshold;
          int threshold_ret =
            bk7258_preferences_wake_threshold_get(&threshold);
          if (!threshold_ret)
            {
              bk7258_agent_trigger_threshold_set(threshold);
            }

          preferences_pending = threshold_ret == -EBUSY;
          syslog(threshold_ret ? LOG_WARNING : LOG_INFO,
                 "BKVOICE wake threshold restore=%d percent=%u\n",
                 threshold_ret, bk7258_agent_trigger_threshold_get());
#endif
          /* Does not block voice start-up; the same configuration task
           * completes the restore once the session is idle.
           */

          int persona_ret = product_apply_persona(-1);
          preferences_pending |= persona_ret == -EBUSY;
          if (persona_ret)
            {
              syslog(LOG_WARNING, "BKVOICE persona restore failed=%d\n",
                     persona_ret);
            }

#ifdef CONFIG_BK7258_PREFERENCES
          if (!persona_ret)
            {
              (void)bkagent_memory_restore(atomic_load(&g_active_persona));
            }

          bool thinking;
          int thinking_ret = bk7258_preferences_thinking_get(&thinking);
          if (!thinking_ret)
            {
              bkagent_cloud_set_thinking(thinking);
            }

          preferences_pending |= thinking_ret == -EBUSY;
          syslog(thinking_ret ? LOG_WARNING : LOG_INFO,
                 "BKVOICE response mode restore result=%d thinking=%d\n",
                 thinking_ret, thinking_ret ? -1 : (int)thinking);
#endif
          preferences_retry_at = now + 1000;
        }

      if (!g_trigger_started && now >= trigger_retry_at)
        {
          unsigned int saved;
          unsigned int observed;
          int ret = bkvoice_volume_store_get(&saved);
          if (!ret)
            {
              ret = bkvoice_media_volume(true, saved, &observed);
            }

          if (ret == -ENOENT)
            {
              ret = 0;
            }

          if (!ret)
            {
              ret = bk7258_agent_trigger_start();
            }

          g_trigger_started = ret == 0;
          g_product_error = ret;
          syslog(ret ? LOG_WARNING : LOG_INFO,
                 "BKVOICE wake ready=%d result=%d\n",
                 g_trigger_started, ret);
          /* A failed model/media load is unavailable until a configuration,
           * model or readiness event arrives; do not reopen it at 50 Hz.
           */

          if (ret == -EBUSY)
            {
              trigger_retry_at = now + 1000;
            }
          else if (ret)
            {
              g_configured = false;
            }
        }

      if (g_trigger_started && (events & 4))
        {
          int ret = bk7258_agent_trigger_process();
          if (ret < 0)
            {
              voice_interaction_active = false;
              g_product_error = ret;
              voice_action = VOICE_ACTION_REARM;
              voice_action_at = now + 100;
            }
          else
            {
              voice_interaction_active = true;
            }
        }
    }
}
#endif

volatile int g_bk7258_agent_pid = -1;
volatile int g_bk7258_agent_launch_pid = -1;
volatile int g_bk7258_agent_launch_errno;
volatile uint32_t g_bk7258_agent_launch_stage;

/* Runtime skills are plain UTF-8 markdown files under /data/agent/skills/.
 * /data is tmpfs in this product, so the built-in skill must be installed on
 * every boot; it only documents tools this product actually registers and
 * contains no credentials or user data. Users may add their own <name>.md
 * files at runtime and the official loader picks them up.
 */

static const char g_product_skill_device_assistant[] =
  "# Device Assistant\n"
  "\n"
  "Answer questions about this device and apply the simple device changes "
  "the user asks for.\n"
  "\n"
  "## When to use\n"
  "When the user asks about battery, volume, mood/persona or what the "
  "device is doing, or asks to change volume, mood, eyes or "
  "vibration.\n"
  "\n"
  "## How to use\n"
  "1. Volume / mood / battery: call device_status. Battery percentage is "
  "unavailable; never estimate it from voltage.\n"
  "2. Motion: call device_motion for fresh three-axis acceleration. It "
  "is an accelerometer, not a gyroscope.\n"
  "3. Changes: call device_control with action volume (0-100), mood "
  "(gentle/playful/quiet/serious/tsundere_lite), vibrate (1-100 ms) or "
  "eyes (neutral/happy/shy/sad/surprised/thinking/listening/speaking/"
  "sleepy). Every repeat request needs a fresh tool call; report errors "
  "honestly.\n"
  "\n"
  "## Example\n"
  "User asks about the battery in Chinese -> device_status -> answer with "
  "voltage, charging state, volume and mood; state that the percentage is "
  "unavailable.\n";

static void install_product_skills(void)
{
  struct product_skill_s
    {
      const char *name;
      const char *body;
    };

  static const struct product_skill_s skills[] =
    {
      "device-assistant.md", g_product_skill_device_assistant
    };

  for (unsigned int i = 0; i < sizeof(skills) / sizeof(skills[0]); i++)
    {
      char path[64];
      FILE *f;

      snprintf(path, sizeof(path), "/data/agent/skills/%s", skills[i].name);
      f = fopen(path, "w");
      if (!f)
        {
          syslog(LOG_WARNING, "bk7258: runtime skill %s not installed: %d\n",
                 path, errno);
          continue;
        }

