Embracecactus/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_agent_product.c
      fputs(skills[i].body, f);
      fclose(f);
      syslog(LOG_INFO, "bk7258: runtime skill installed: %s\n", path);
    }
}

/* The fixed official package has no core-only bootstrap entry: its sole
 * main also starts CLI, WebSocket, cron, heartbeat and a competing network
 * owner. This product entry only initializes the retained official core
 * and maps its outbound voice channel to the official voice output. It
 * does not implement a second Agent loop, session store, ASR/TTS pipeline
 * or recovery scheduler.
 */

int ai_agent_main(int argc, FAR char *argv[])
{
  static const char *directories[] =
    {
      "/data/agent", "/data/agent/config", "/data/agent/memory",
      "/data/agent/sessions", "/data/agent/skills"
    };

  int ret;

  (void)argc;
  (void)argv;

  for (unsigned int i = 0;
       i < sizeof(directories) / sizeof(directories[0]); i++)
    {
      if (mkdir(directories[i], 0755) < 0 && errno != EEXIST)
        {
          syslog(LOG_ERR, "bk7258: Agent directory %s failed: %d\n",
                 directories[i], errno);
          return ERROR;
        }
    }

  install_product_skills();

  ret = config_store_init();
  if (!ret)
    {
      ret = message_bus_init();
    }

  if (!ret)
    {
      ret = memory_store_init();
    }

  if (!ret)
    {
      ret = session_mgr_init();
    }

  if (!ret)
    {
      ret = http_proxy_init();
    }

  if (!ret)
    {
      ret = llm_proxy_init();
    }

  if (!ret)
    {
      ret = llm_router_init();
    }

  if (!ret)
    {
      ret = tool_guard_init();
    }

#ifdef CONFIG_BK7258_VOICE_TLS
  if (!ret) tool_registry_register_provider_checked("bk7258-device",
    product_tools, product_tool_execute);
#endif
#ifdef CONFIG_BK7258_VISION_SERVICE
  if (!ret)
    {
      bk7258_agent_vision_register();
    }

#endif
  if (!ret)
    {
      ret = agent_loop_init();
    }

  if (!ret)
    {
      ret = voice_channel_init();
    }

  if (!ret)
    {
      ret = agent_loop_start();
    }

  if (ret)
    {
      syslog(LOG_ERR, "bk7258: official Agent core init failed: %d\n", ret);
#ifdef CONFIG_BK7258_VOICE_TLS
      voice_channel_service_ready(ret);
      g_product_error = ret;
#endif
      return ERROR;
    }

#ifdef CONFIG_BK7258_VOICE_TLS
  voice_channel_service_ready(0);
  atomic_store(&g_agent_core_ready, true);
  sem_post(&g_product_wake);
#endif
  syslog(LOG_INFO, "bk7258: official Agent core ready\n");

  while (!agent_shutdown_requested())
    {
      agent_msg_t message;
      ret = message_bus_pop_outbound(&message, 1000);
      if (ret != OK)
        {
          continue;
        }

      if (!strcmp(message.channel, AGENT_CHAN_VOICE) && message.content)
        {
          ret = message.request_complete ?
                voice_channel_speak_reply(message.request_id,
                                          message.content) :
                voice_channel_speak(message.content);
#if defined(CONFIG_BK7258_VOICE_TLS) && defined(CONFIG_BK7258_PREFERENCES)
          if (!ret && message.request_complete)
            (void)bkagent_memory_commit(atomic_load(&g_active_persona),
                                        message.content);
#endif
          if (message.request_complete)
            message.request_complete(message.request_id, ret);
#ifdef CONFIG_BK7258_VOICE_TLS
          if (ret)
            {
              g_product_error = ret;
              syslog(LOG_WARNING,
                     "bk7258: official voice output failed: %d\n", ret);
            }
#endif
        }
      else
        {
          ret = -ENOTSUP;
          if (message.request_complete)
            message.request_complete(message.request_id, ret);
          syslog(LOG_WARNING,
                 "bk7258: unsupported Agent output channel=%s\n",
                 message.channel);
        }

      message_bus_msg_free(&message);
    }

  message_bus_wakeup();
  return OK;
}

#ifdef CONFIG_AI_AGENT_LVGL_UI
volatile uint32_t g_bk7258_agent_ui_show_attempts;

static int bk7258_agent_ui_show_task(int argc, FAR char *argv[])
{
  unsigned int attempt;

  (void)argc;
  (void)argv;

  /* Agent phase-3 initializes the widgets and phase-5 marks the LVGL channel
   * running.  show() is idempotent after the chat screen becomes visible, so
   * retry for one bounded startup window.
   */

  for (attempt = 0; attempt < 30; attempt++)
    {
      nxsig_usleep(1000000u);
      g_bk7258_agent_ui_show_attempts = attempt + 1u;
      lvgl_ui_channel_show();
    }

  return OK;
}
#endif

int bk7258_agent_product_prepare(void)
{
#ifdef CONFIG_BK7258_VOICE_TLS
  int ret = bkagent_cloud_register();
  if (ret != 0)
    {
      return ret;
    }

  ret = audio_capture_set_route(product_capture_route);
  if (ret != 0)
    {
      return ret;
    }

  ret = audio_capture_set_route_prepare(product_capture_prepare);
  if (ret != 0) return ret;

  if (sem_init(&g_product_wake, 0, 0) < 0)
    {
      return -errno;
    }

#ifdef CONFIG_BK7258_PRODUCT_KEYS
  ret = bkvoice_keys_listen(product_keys_notify);
  if (ret != 0)
    {
      return ret;
    }

#endif
  ret = voice_channel_set_event_callback(bk7258_agent_voice_event);
  if (ret != 0)
    {
      return ret;
    }

  bkprov_storage_set_notify(bk7258_agent_storage_changed);
#endif
#ifdef CONFIG_AI_AGENT_LVGL_UI
  return bk7258_board_ui_initialize();
#else
  return OK;
#endif
}

static int bk7258_agent_launch_task(int argc, FAR char *argv[])
{
  pid_t agentpid;
#ifdef CONFIG_AI_AGENT_LVGL_UI
  pid_t showpid;
  int ret;
#endif

  (void)argc;
  (void)argv;
  g_bk7258_agent_launch_stage = 2u;

#ifdef CONFIG_AI_AGENT_LVGL_UI
  ret = bk7258_board_ui_wait_ready();
  if (ret < 0)
    {
      g_bk7258_agent_launch_stage = 0x82u;
      syslog(LOG_ERR, "bk7258: Agent LVGL wait failed: %d\n", ret);
      g_bk7258_agent_pid = ret;
      return ERROR;
    }
#endif

  g_bk7258_agent_launch_stage = 3u;

  /* Current-conversation files use the official session manager on volatile
   * storage. Existing encrypted persistent memory is not converted to plain
   * files or uploaded by this candidate. Its migration remains explicit.
   */

  if (mount(NULL, "/data", "tmpfs", 0, NULL) < 0)
    {
      syslog(LOG_ERR, "bk7258: Agent volatile storage unavailable: %d\n",
             errno);
      return ERROR;
    }

